notes/meeting_2022may08.org
* meeting notes May 08, 2022
** the raku study group
*** "Raku Saki Robots" (?)
*** usual links
**** these notes
***** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022may08.md
**** code examples
***** https://github.com/doomvox/raku-study/tree/main/bin/2022may08

** the new "darkroast" project
*** https://github.com/doomvox/darkroast
*** expanded the first test there
**** https://github.com/doomvox/darkroast/tree/main/S12-introspection
**** miscelanious things could be said about the code
***** /home/doom/End/Cave/Raku/Notes/notes-darkroast-caret_methods_method

** raku's "move" considered screwed-up
*** https://docs.raku.org/routine/move
*** "To avoid copying, you can use rename, if the files are on the same storage device. It also works with directories, while move does not."
*** discussed last meeting:
***** https://stackoverflow.com/questions/71909580/move-function-does-not-work-in-raku-in-windows/71973303#71973303

** bill michaels
*** https://unix.stackexchange.com/a/699417/227738 
*** https://stackoverflow.com/a/71973303/7270649 
*** https://stackoverflow.com/a/71989016/7270649  
*** https://unix.stackexchange.com/a/699338/227738 

*** https://corky.net/dotan/log/2009/06/heres-why-people-hate-perl-folks.html 
**** bill michaels brought up this piece from 2009
**** true enough: "There are many wonderful modules in CPAN, but learning about them, learning to use them, finding out about their hidden corner-cases and unexpected behaviors takes even more time"
**** eh: "People hate Perl for the same reason we love it-- because it makes us feel clever."
**** links to steve yegge: https://sites.google.com/site/steveyegge2/ancient-languages-perl
**** http://obsidianrook.com/doomfiles/CASE_STUDY_2.html
**** http://obsidianrook.com/doomfiles/GENTLE_ART_OF_PROGRAMMING.html
**** http://obsidianrook.com/doomfiles/SIGILS_OF_POWER.html
**** http://obsidianrook.com/doomfiles/THE_PERL_AFFAIR.html

**** move/copy command in Raku doesn't work with directory as second arg
***** https://stackoverflow.com/questions/71909580/move-function-does-not-work-in-raku-in-windows/71973303#71973303

***** raku -e 'for dir(test => / .+ \.txt /) {.say};'

***** "persons.txt".IO
"time.txt".IO

***** raku -e 'mkdir IO::Path.new("../dest");'

***** raku -e 'for dir(test => / .+ \.txt $ /) { copy $_, "../dest/$_", createonly => True};'

***** ls ../dest

***** persons.txt time.txt



** equilibirum index
*** http://rosettacode.org/wiki/Equilibrium_index#Single-pass_solution
*** TODO revisit this next time (Rob solution?)

** TODO Rob's interested in discussing missing basic tools

** weekly challenge this week
*** https://theweeklychallenge.org/

** from previous meetings
*** an answer to what's Raku for:
**** https://www.codesections.com/blog/raku-manifesto/

*** gui toolkits
**** gtk3
***** marcel timmerman on raku
***** https://modules.raku.org/dist/Gnome::Gtk3
***** https://github.com/MARTIMM/gnome-gtk3/issues/28#issue-1199187148 
**** iup
***** https://en.wikipedia.org/wiki/IUP_(software)
***** https://raku.land/github:hankache/IUP
**** wish based tk 

** announcements 
*** May 8th: next raku study group meeting 
*** June 21-25: tprc: perl/raku conference 
